* No Hlines or Groups

#+NAME: trades1
| Ref  |       Date | Code |  Price | G10 | QP10 | Shares |   LP |    QP |   IPLP |   IPQP |
|------+------------+------+--------+-----+------+--------+------+-------+--------+--------|
| T001 | 2016-11-01 | P    | 7.7000 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T002 | 2016-11-01 | P    | 7.7500 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |
| T003 | 2016-11-01 | P    | 7.5000 | F   | T    |    800 |  112 |   688 | 0.2453 | 0.1924 |
| T004 | 2016-11-01 | S    | 7.5500 | T   | F    |   6811 |  966 |  5845 | 0.2453 | 0.1924 |
| T005 | 2016-11-01 | S    | 7.5000 | F   | F    |   4000 |  572 |  3428 | 0.2453 | 0.1924 |
| T006 | 2016-11-01 | S    | 7.6000 | F   | T    |   1000 |  143 |   857 | 0.2453 | 0.1924 |
| T007 | 2016-11-01 | S    | 7.6500 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |
| T008 | 2016-11-01 | P    | 7.6500 | F   | F    |   2771 |  393 |  2378 | 0.2453 | 0.1924 |
| T009 | 2016-11-01 | P    | 7.6000 | F   | F    |   9550 | 1363 |  8187 | 0.2453 | 0.1924 |
| T010 | 2016-11-01 | P    | 7.5500 | F   | T    |   3175 |  451 |  2724 | 0.2453 | 0.1924 |
| T011 | 2016-11-02 | P    | 7.4250 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T012 | 2016-11-02 | P    | 7.5500 | F   | F    |   4700 |  677 |  4023 | 0.2453 | 0.1924 |
| T013 | 2016-11-02 | P    | 7.3500 | T   | T    |  53100 | 7656 | 45444 | 0.2453 | 0.1924 |
| T014 | 2016-11-02 | P    | 7.4500 | F   | T    |   5847 |  835 |  5012 | 0.2453 | 0.1924 |
| T015 | 2016-11-02 | P    | 7.7500 | F   | F    |    500 |   72 |   428 | 0.2453 | 0.1924 |
| T016 | 2016-11-02 | P    | 8.2500 | T   | T    |    100 |   14 |    86 | 0.2453 | 0.1924 |

#+HEADER: :colnames no
#+BEGIN_SRC ruby :var tab=trades1
  require 'fat_table'
  tab = FatTable.from_aoa(tab).where('shares > 500')
  FatTable.to_aoa(tab)
#+END_SRC

#+RESULTS:
| Ref  |       Date | Code | Price | G10 | QP10 | Shares |   Lp |    Qp |   Iplp |   Ipqp |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T003 | 2016-11-01 | P    |   7.5 | F   | T    |    800 |  112 |   688 | 0.2453 | 0.1924 |
| T004 | 2016-11-01 | S    |  7.55 | T   | F    |   6811 |  966 |  5845 | 0.2453 | 0.1924 |
| T005 | 2016-11-01 | S    |   7.5 | F   | F    |   4000 |  572 |  3428 | 0.2453 | 0.1924 |
| T006 | 2016-11-01 | S    |   7.6 | F   | T    |   1000 |  143 |   857 | 0.2453 | 0.1924 |
| T008 | 2016-11-01 | P    |  7.65 | F   | F    |   2771 |  393 |  2378 | 0.2453 | 0.1924 |
| T009 | 2016-11-01 | P    |   7.6 | F   | F    |   9550 | 1363 |  8187 | 0.2453 | 0.1924 |
| T010 | 2016-11-01 | P    |  7.55 | F   | T    |   3175 |  451 |  2724 | 0.2453 | 0.1924 |
| T012 | 2016-11-02 | P    |  7.55 | F   | F    |   4700 |  677 |  4023 | 0.2453 | 0.1924 |
| T013 | 2016-11-02 | P    |  7.35 | T   | T    |  53100 | 7656 | 45444 | 0.2453 | 0.1924 |
| T014 | 2016-11-02 | P    |  7.45 | F   | T    |   5847 |  835 |  5012 | 0.2453 | 0.1924 |

* With Hlines and Groups

#+NAME: trades2
| Ref  |       Date | Code |  Price | G10 | QP10 | Shares |   LP |    QP |   IPLP |   IPQP |
|------+------------+------+--------+-----+------+--------+------+-------+--------+--------|
| T001 | 2016-11-01 | P    | 7.7000 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T002 | 2016-11-01 | P    | 7.7500 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |
| T003 | 2016-11-01 | P    | 7.5000 | F   | T    |    800 |  112 |   688 | 0.2453 | 0.1924 |
|------+------------+------+--------+-----+------+--------+------+-------+--------+--------|
| T004 | 2016-11-01 | S    | 7.5500 | T   | F    |   6811 |  966 |  5845 | 0.2453 | 0.1924 |
| T005 | 2016-11-01 | S    | 7.5000 | F   | F    |   4000 |  572 |  3428 | 0.2453 | 0.1924 |
| T006 | 2016-11-01 | S    | 7.6000 | F   | T    |   1000 |  143 |   857 | 0.2453 | 0.1924 |
| T007 | 2016-11-01 | S    | 7.6500 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |
| T008 | 2016-11-01 | P    | 7.6500 | F   | F    |   2771 |  393 |  2378 | 0.2453 | 0.1924 |
| T009 | 2016-11-01 | P    | 7.6000 | F   | F    |   9550 | 1363 |  8187 | 0.2453 | 0.1924 |
|------+------------+------+--------+-----+------+--------+------+-------+--------+--------|
| T010 | 2016-11-01 | P    | 7.5500 | F   | T    |   3175 |  451 |  2724 | 0.2453 | 0.1924 |
| T011 | 2016-11-02 | P    | 7.4250 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T012 | 2016-11-02 | P    | 7.5500 | F   | F    |   4700 |  677 |  4023 | 0.2453 | 0.1924 |
| T013 | 2016-11-02 | P    | 7.3500 | T   | T    |  53100 | 7656 | 45444 | 0.2453 | 0.1924 |
|------+------------+------+--------+-----+------+--------+------+-------+--------+--------|
| T014 | 2016-11-02 | P    | 7.4500 | F   | T    |   5847 |  835 |  5012 | 0.2453 | 0.1924 |
| T015 | 2016-11-02 | P    | 7.7500 | F   | F    |    500 |   72 |   428 | 0.2453 | 0.1924 |
| T016 | 2016-11-02 | P    | 8.2500 | T   | T    |    100 |   14 |    86 | 0.2453 | 0.1924 |

#+HEADER: :colnames no :hlines yes
#+BEGIN_SRC ruby :var trades=trades2
  require 'fat_table'
  trades = FatTable.from_aoa(trades, hlines: true).where('shares > 500')
  FatTable.to_aoa(trades)
#+END_SRC

#+RESULTS:
| Ref  |       Date | Code | Price | G10 | QP10 | Shares |   Lp |    Qp |   Iplp |   Ipqp |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T003 | 2016-11-01 | P    |   7.5 | F   | T    |    800 |  112 |   688 | 0.2453 | 0.1924 |
| T004 | 2016-11-01 | S    |  7.55 | T   | F    |   6811 |  966 |  5845 | 0.2453 | 0.1924 |
| T005 | 2016-11-01 | S    |   7.5 | F   | F    |   4000 |  572 |  3428 | 0.2453 | 0.1924 |
| T006 | 2016-11-01 | S    |   7.6 | F   | T    |   1000 |  143 |   857 | 0.2453 | 0.1924 |
| T008 | 2016-11-01 | P    |  7.65 | F   | F    |   2771 |  393 |  2378 | 0.2453 | 0.1924 |
| T009 | 2016-11-01 | P    |   7.6 | F   | F    |   9550 | 1363 |  8187 | 0.2453 | 0.1924 |
| T010 | 2016-11-01 | P    |  7.55 | F   | T    |   3175 |  451 |  2724 | 0.2453 | 0.1924 |
| T012 | 2016-11-02 | P    |  7.55 | F   | F    |   4700 |  677 |  4023 | 0.2453 | 0.1924 |
| T013 | 2016-11-02 | P    |  7.35 | T   | T    |  53100 | 7656 | 45444 | 0.2453 | 0.1924 |
| T014 | 2016-11-02 | P    |  7.45 | F   | T    |   5847 |  835 |  5012 | 0.2453 | 0.1924 |

#+HEADER: :colnames no :hlines yes
#+BEGIN_SRC ruby :var tab=trades2
  require 'fat_table'
  tab = FatTable.from_aoa(tab, hlines: true)
  FatTable.to_aoa(tab)
#+END_SRC

#+RESULTS:
| Ref  |       Date | Code | Price | G10 | QP10 | Shares |   Lp |    Qp |   Iplp |   Ipqp |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T001 | 2016-11-01 | P    |   7.7 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T002 | 2016-11-01 | P    |  7.75 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |
| T003 | 2016-11-01 | P    |   7.5 | F   | T    |    800 |  112 |   688 | 0.2453 | 0.1924 |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T004 | 2016-11-01 | S    |  7.55 | T   | F    |   6811 |  966 |  5845 | 0.2453 | 0.1924 |
| T005 | 2016-11-01 | S    |   7.5 | F   | F    |   4000 |  572 |  3428 | 0.2453 | 0.1924 |
| T006 | 2016-11-01 | S    |   7.6 | F   | T    |   1000 |  143 |   857 | 0.2453 | 0.1924 |
| T007 | 2016-11-01 | S    |  7.65 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |
| T008 | 2016-11-01 | P    |  7.65 | F   | F    |   2771 |  393 |  2378 | 0.2453 | 0.1924 |
| T009 | 2016-11-01 | P    |   7.6 | F   | F    |   9550 | 1363 |  8187 | 0.2453 | 0.1924 |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T010 | 2016-11-01 | P    |  7.55 | F   | T    |   3175 |  451 |  2724 | 0.2453 | 0.1924 |
| T011 | 2016-11-02 | P    | 7.425 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T012 | 2016-11-02 | P    |  7.55 | F   | F    |   4700 |  677 |  4023 | 0.2453 | 0.1924 |
| T013 | 2016-11-02 | P    |  7.35 | T   | T    |  53100 | 7656 | 45444 | 0.2453 | 0.1924 |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T014 | 2016-11-02 | P    |  7.45 | F   | T    |   5847 |  835 |  5012 | 0.2453 | 0.1924 |
| T015 | 2016-11-02 | P    |  7.75 | F   | F    |    500 |   72 |   428 | 0.2453 | 0.1924 |
| T016 | 2016-11-02 | P    |  8.25 | T   | T    |    100 |   14 |    86 | 0.2453 | 0.1924 |


#+HEADER: :colnames no :hlines yes :session example
#+BEGIN_SRC ruby :var tab=trades2
  require 'fat_table'
  trades = FatTable.from_aoa(tab, hlines: true)
  FatTable.to_aoa(trades)
#+END_SRC

#+RESULTS:
| Ref  |       Date | Code | Price | G10 | QP10 | Shares |   Lp |    Qp |   Iplp |   Ipqp |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T001 | 2016-11-01 | P    |   7.7 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T002 | 2016-11-01 | P    |  7.75 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |
| T003 | 2016-11-01 | P    |   7.5 | F   | T    |    800 |  112 |   688 | 0.2453 | 0.1924 |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T004 | 2016-11-01 | S    |  7.55 | T   | F    |   6811 |  966 |  5845 | 0.2453 | 0.1924 |
| T005 | 2016-11-01 | S    |   7.5 | F   | F    |   4000 |  572 |  3428 | 0.2453 | 0.1924 |
| T006 | 2016-11-01 | S    |   7.6 | F   | T    |   1000 |  143 |   857 | 0.2453 | 0.1924 |
| T007 | 2016-11-01 | S    |  7.65 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |
| T008 | 2016-11-01 | P    |  7.65 | F   | F    |   2771 |  393 |  2378 | 0.2453 | 0.1924 |
| T009 | 2016-11-01 | P    |   7.6 | F   | F    |   9550 | 1363 |  8187 | 0.2453 | 0.1924 |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T010 | 2016-11-01 | P    |  7.55 | F   | T    |   3175 |  451 |  2724 | 0.2453 | 0.1924 |
| T011 | 2016-11-02 | P    | 7.425 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T012 | 2016-11-02 | P    |  7.55 | F   | F    |   4700 |  677 |  4023 | 0.2453 | 0.1924 |
| T013 | 2016-11-02 | P    |  7.35 | T   | T    |  53100 | 7656 | 45444 | 0.2453 | 0.1924 |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T014 | 2016-11-02 | P    |  7.45 | F   | T    |   5847 |  835 |  5012 | 0.2453 | 0.1924 |
| T015 | 2016-11-02 | P    |  7.75 | F   | F    |    500 |   72 |   428 | 0.2453 | 0.1924 |
| T016 | 2016-11-02 | P    |  8.25 | T   | T    |    100 |   14 |    86 | 0.2453 | 0.1924 |

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby :session example
  tab = trades.select(:price, :ref, :shares)
  FatTable.to_aoa(tab)
#+END_SRC

#+RESULTS:
| Price | Ref  | Shares |
|-------+------+--------|
|   7.7 | T001 |    100 |
|  7.75 | T002 |    200 |
|   7.5 | T003 |    800 |
|-------+------+--------|
|  7.55 | T004 |   6811 |
|   7.5 | T005 |   4000 |
|   7.6 | T006 |   1000 |
|  7.65 | T007 |    200 |
|  7.65 | T008 |   2771 |
|   7.6 | T009 |   9550 |
|-------+------+--------|
|  7.55 | T010 |   3175 |
| 7.425 | T011 |    100 |
|  7.55 | T012 |   4700 |
|  7.35 | T013 |  53100 |
|-------+------+--------|
|  7.45 | T014 |   5847 |
|  7.75 | T015 |    500 |
|  8.25 | T016 |    100 |

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby :session example
  tab = trades.select(:ref, :price, :shares, traded_on: :date, cost: 'price * shares')
  FatTable.to_aoa(tab)
#+END_SRC

#+RESULTS:
| Ref  | Price | Shares |  Traded On |     Cost |
|------+-------+--------+------------+----------|
| T001 |   7.7 |    100 | 2016-11-01 |    770.0 |
| T002 |  7.75 |    200 | 2016-11-01 |   1550.0 |
| T003 |   7.5 |    800 | 2016-11-01 |   6000.0 |
|------+-------+--------+------------+----------|
| T004 |  7.55 |   6811 | 2016-11-01 | 51423.05 |
| T005 |   7.5 |   4000 | 2016-11-01 |  30000.0 |
| T006 |   7.6 |   1000 | 2016-11-01 |   7600.0 |
| T007 |  7.65 |    200 | 2016-11-01 |   1530.0 |
| T008 |  7.65 |   2771 | 2016-11-01 | 21198.15 |
| T009 |   7.6 |   9550 | 2016-11-01 |  72580.0 |
|------+-------+--------+------------+----------|
| T010 |  7.55 |   3175 | 2016-11-01 | 23971.25 |
| T011 | 7.425 |    100 | 2016-11-02 |    742.5 |
| T012 |  7.55 |   4700 | 2016-11-02 |  35485.0 |
| T013 |  7.35 |  53100 | 2016-11-02 | 390285.0 |
|------+-------+--------+------------+----------|
| T014 |  7.45 |   5847 | 2016-11-02 | 43560.15 |
| T015 |  7.75 |    500 | 2016-11-02 |   3875.0 |
| T016 |  8.25 |    100 | 2016-11-02 |    825.0 |

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab = trades.select(:ref, :price, :shares, cost: 'price * shares')
  FatTable.to_aoa(tab)
#+END_SRC

#+RESULTS:
| Ref  | Price | Shares |     Cost |
|------+-------+--------+----------|
| T001 |   7.7 |    100 |    770.0 |
| T002 |  7.75 |    200 |   1550.0 |
| T003 |   7.5 |    800 |   6000.0 |
|------+-------+--------+----------|
| T004 |  7.55 |   6811 | 51423.05 |
| T005 |   7.5 |   4000 |  30000.0 |
| T006 |   7.6 |   1000 |   7600.0 |
| T007 |  7.65 |    200 |   1530.0 |
| T008 |  7.65 |   2771 | 21198.15 |
| T009 |   7.6 |   9550 |  72580.0 |
|------+-------+--------+----------|
| T010 |  7.55 |   3175 | 23971.25 |
| T011 | 7.425 |    100 |    742.5 |
| T012 |  7.55 |   4700 |  35485.0 |
| T013 |  7.35 |  53100 | 390285.0 |
|------+-------+--------+----------|
| T014 |  7.45 |   5847 | 43560.15 |
| T015 |  7.75 |    500 |   3875.0 |
| T016 |  8.25 |    100 |    825.0 |

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab = trades.
          select(:ref, :price, :shares, traded_on: :date, cost: 'price * shares').
          select(:ref, :traded_on, :price, :shares, :cost)
  FatTable.to_aoa(tab)
#+END_SRC

#+RESULTS:
| Ref  |  Traded On | Price | Shares |     Cost |
|------+------------+-------+--------+----------|
| T001 | 2016-11-01 |   7.7 |    100 |    770.0 |
| T002 | 2016-11-01 |  7.75 |    200 |   1550.0 |
| T003 | 2016-11-01 |   7.5 |    800 |   6000.0 |
|------+------------+-------+--------+----------|
| T004 | 2016-11-01 |  7.55 |   6811 | 51423.05 |
| T005 | 2016-11-01 |   7.5 |   4000 |  30000.0 |
| T006 | 2016-11-01 |   7.6 |   1000 |   7600.0 |
| T007 | 2016-11-01 |  7.65 |    200 |   1530.0 |
| T008 | 2016-11-01 |  7.65 |   2771 | 21198.15 |
| T009 | 2016-11-01 |   7.6 |   9550 |  72580.0 |
|------+------------+-------+--------+----------|
| T010 | 2016-11-01 |  7.55 |   3175 | 23971.25 |
| T011 | 2016-11-02 | 7.425 |    100 |    742.5 |
| T012 | 2016-11-02 |  7.55 |   4700 |  35485.0 |
| T013 | 2016-11-02 |  7.35 |  53100 | 390285.0 |
|------+------------+-------+--------+----------|
| T014 | 2016-11-02 |  7.45 |   5847 | 43560.15 |
| T015 | 2016-11-02 |  7.75 |    500 |   3875.0 |
| T016 | 2016-11-02 |  8.25 |    100 |    825.0 |

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab = trades.where('@row.even? && (g10 || qp10)')
  FatTable.to_aoa(tab)
#+END_SRC

#+RESULTS:
| Ref  |       Date | Code | Price | G10 | QP10 | Shares |  Lp |   Qp |   Iplp |   Ipqp |
|------+------------+------+-------+-----+------+--------+-----+------+--------+--------|
| T002 | 2016-11-01 | P    |  7.75 | T   | F    |    200 |  28 |  172 | 0.2453 | 0.1924 |
| T004 | 2016-11-01 | S    |  7.55 | T   | F    |   6811 | 966 | 5845 | 0.2453 | 0.1924 |
| T006 | 2016-11-01 | S    |   7.6 | F   | T    |   1000 | 143 |  857 | 0.2453 | 0.1924 |
| T010 | 2016-11-01 | P    |  7.55 | F   | T    |   3175 | 451 | 2724 | 0.2453 | 0.1924 |
| T014 | 2016-11-02 | P    |  7.45 | F   | T    |   5847 | 835 | 5012 | 0.2453 | 0.1924 |
| T016 | 2016-11-02 | P    |  8.25 | T   | T    |    100 |  14 |   86 | 0.2453 | 0.1924 |


#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab = trades.order_by(:code, :date)
  FatTable.to_aoa(tab)
#+END_SRC

#+RESULTS:
| Ref  |       Date | Code | Price | G10 | QP10 | Shares |   Lp |    Qp |   Iplp |   Ipqp |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T001 | 2016-11-01 | P    |   7.7 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T002 | 2016-11-01 | P    |  7.75 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |
| T003 | 2016-11-01 | P    |   7.5 | F   | T    |    800 |  112 |   688 | 0.2453 | 0.1924 |
| T008 | 2016-11-01 | P    |  7.65 | F   | F    |   2771 |  393 |  2378 | 0.2453 | 0.1924 |
| T009 | 2016-11-01 | P    |   7.6 | F   | F    |   9550 | 1363 |  8187 | 0.2453 | 0.1924 |
| T010 | 2016-11-01 | P    |  7.55 | F   | T    |   3175 |  451 |  2724 | 0.2453 | 0.1924 |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T011 | 2016-11-02 | P    | 7.425 | T   | F    |    100 |   14 |    86 | 0.2453 | 0.1924 |
| T012 | 2016-11-02 | P    |  7.55 | F   | F    |   4700 |  677 |  4023 | 0.2453 | 0.1924 |
| T013 | 2016-11-02 | P    |  7.35 | T   | T    |  53100 | 7656 | 45444 | 0.2453 | 0.1924 |
| T014 | 2016-11-02 | P    |  7.45 | F   | T    |   5847 |  835 |  5012 | 0.2453 | 0.1924 |
| T015 | 2016-11-02 | P    |  7.75 | F   | F    |    500 |   72 |   428 | 0.2453 | 0.1924 |
| T016 | 2016-11-02 | P    |  8.25 | T   | T    |    100 |   14 |    86 | 0.2453 | 0.1924 |
|------+------------+------+-------+-----+------+--------+------+-------+--------+--------|
| T004 | 2016-11-01 | S    |  7.55 | T   | F    |   6811 |  966 |  5845 | 0.2453 | 0.1924 |
| T005 | 2016-11-01 | S    |   7.5 | F   | F    |   4000 |  572 |  3428 | 0.2453 | 0.1924 |
| T006 | 2016-11-01 | S    |   7.6 | F   | T    |   1000 |  143 |   857 | 0.2453 | 0.1924 |
| T007 | 2016-11-01 | S    |  7.65 | T   | F    |    200 |   28 |   172 | 0.2453 | 0.1924 |

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab = trades.
          group_by(:code, :date, price: :avg,
                   shares: :sum, lp: :sum, qp: :sum,
                   g10: :any?, qp10: :all?)
  FatTable.to_aoa(tab)
#+END_SRC

#+RESULTS:
| Code |       Date | Avg Price | Sum Shares | Sum Lp | Sum Qp | Any G10 | All QP10 | First Ref | First Iplp | First Ipqp |
|------+------------+-----------+------------+--------+--------+---------+----------+-----------+------------+------------|
| P    | 2016-11-01 |     7.625 |      16596 |   2361 |  14235 | T       | F        | T001      |     0.2453 |     0.1924 |
| P    | 2016-11-02 |  7.629167 |      64347 |   9268 |  55079 | T       | F        | T011      |     0.2453 |     0.1924 |
| S    | 2016-11-01 |     7.575 |      12011 |   1709 |  10302 | T       | F        | T004      |     0.2453 |     0.1924 |

Result broken up for display purposes:

| Code |       Date | Avg Price | Sum Shares | Sum Lp | Sum Qp |
|------+------------+-----------+------------+--------+--------|
| P    | 2016-11-01 |     7.625 |      16596 |   2361 |  14235 |
| P    | 2016-11-02 |  7.629167 |      64347 |   9268 |  55079 |
| S    | 2016-11-01 |     7.575 |      12011 |   1709 |  10302 |

| Code |       Date | Any G10 | All QP10 | First Ref | First Iplp | First Ipqp |
|------+------------+---------+----------+-----------+------------+------------|
| P    | 2016-11-01 | T       | F        | T001      |     0.2453 |     0.1924 |
| P    | 2016-11-02 | T       | F        | T011      |     0.2453 |     0.1924 |
| S    | 2016-11-01 | T       | F        | T004      |     0.2453 |     0.1924 |

* Join Examples

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  require 'fat_table'
  tab_a = FatTable.from_aoh([
      { id: 1, name: 'Paul', age: 32, address: 'California', salary: 20000, join_date: '2001-07-13' },
      { id: 3, name: 'Teddy', age: 23, address: 'Norway', salary: 20000},
      { id: 4, name: 'Mark', age: 25, address: 'Rich-Mond', salary: 65000, join_date: '2007-12-13' },
      { id: 5, name: 'David', age: 27, address: 'Texas', salary: 85000, join_date: '2007-12-13' },
      { id: 2, name: 'Allen', age: 25, address: 'Texas', salary: nil, join_date: '2007-12-13' },
      { id: 8, name: 'Paul', age: 24, address: 'Houston', salary: 20000, join_date: '2005-07-13' },
      { id: 9, name: 'James', age: 44, address: 'Norway', salary: 5000, join_date: '2005-07-13' },
      { id: 10, name: 'James', age: 45, address: 'Texas', salary: 5000, join_date: '2005-07-13' }
    ])
  tab_a.to_aoa
#+END_SRC

#+RESULTS:
| Id | Name  | Age | Address    | Salary |  Join Date |
|----+-------+-----+------------+--------+------------|
|  1 | Paul  |  32 | California |  20000 | 2001-07-13 |
|  3 | Teddy |  23 | Norway     |  20000 | 2007-12-13 |
|  4 | Mark  |  25 | Rich-Mond  |  65000 | 2007-12-13 |
|  5 | David |  27 | Texas      |  85000 | 2007-12-13 |
|  2 | Allen |  25 | Texas      |        | 2005-07-13 |
|  8 | Paul  |  24 | Houston    |  20000 | 2005-07-13 |
|  9 | James |  44 | Norway     |   5000 | 2005-07-13 |
| 10 | James |  45 | Texas      |   5000 |            |



#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab_b = FatTable.from_aoh([
    { id: 1, dept: 'IT Billing', emp_id: 1 },
    { id: 2, dept: 'Engineering', emp_id: 2 },
    { id: 3, dept: 'Finance', emp_id: 7 }
  ])
  tab_b.to_aoa
#+END_SRC

#+RESULTS:
| Id | Dept        | Emp Id |
|----+-------------+--------|
|  1 | IT Billing  |      1 |
|  2 | Engineering |      2 |
|  3 | Finance     |      7 |


** Inner Joins

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab_a.join(tab_b).to_aoa
#+END_SRC

#+RESULTS:
| Id | Name  | Age | Address    | Salary |  Join Date | Dept        | Emp Id |
|----+-------+-----+------------+--------+------------+-------------+--------|
|  1 | Paul  |  32 | California |  20000 | 2001-07-13 | IT Billing  |      1 |
|  3 | Teddy |  23 | Norway     |  20000 | 2007-12-13 | Finance     |      7 |
|  2 | Allen |  25 | Texas      |        | 2005-07-13 | Engineering |      2 |

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab_a.join(tab_b, :id_a, :emp_id_b).to_aoa
#+END_SRC

#+RESULTS:
| Id | Name  | Age | Address    | Salary |  Join Date | Id B | Dept        |
|----+-------+-----+------------+--------+------------+------+-------------|
|  1 | Paul  |  32 | California |  20000 | 2001-07-13 |    1 | IT Billing  |
|  2 | Allen |  25 | Texas      |        | 2005-07-13 |    2 | Engineering |

** Left and Right Joins

#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab_a.left_join(tab_b, 'id_a == emp_id_b').to_aoa
#+END_SRC

#+RESULTS:
| Id | Name  | Age | Address    | Salary |  Join Date | Id B | Dept        | Emp Id |
|----+-------+-----+------------+--------+------------+------+-------------+--------|
|  1 | Paul  |  32 | California |  20000 | 2001-07-13 |    1 | IT Billing  |      1 |
|  3 | Teddy |  23 | Norway     |  20000 | 2007-12-13 |      |             |        |
|  4 | Mark  |  25 | Rich-Mond  |  65000 | 2007-12-13 |      |             |        |
|  5 | David |  27 | Texas      |  85000 | 2007-12-13 |      |             |        |
|  2 | Allen |  25 | Texas      |        | 2005-07-13 |    2 | Engineering |      2 |
|  8 | Paul  |  24 | Houston    |  20000 | 2005-07-13 |      |             |        |
|  9 | James |  44 | Norway     |   5000 | 2005-07-13 |      |             |        |
| 10 | James |  45 | Texas      |   5000 |            |      |             |        |


#+HEADER: :colnames no :session example :hlines yes
#+BEGIN_SRC ruby
  tab_a.right_join(tab_b, 'id_a == emp_id_b').to_aoa
#+END_SRC

#+RESULTS:
| Id | Name  | Age | Address    | Salary |  Join Date | Id B | Dept        | Emp Id |
|----+-------+-----+------------+--------+------------+------+-------------+--------|
|  1 | Paul  |  32 | California |  20000 | 2001-07-13 |    1 | IT Billing  |      1 |
|  2 | Allen |  25 | Texas      |        | 2005-07-13 |    2 | Engineering |      2 |
|    |       |     |            |        |            |    3 | Finance     |      7 |

** Full Join

#+HEADER: :colnames no :session example :hlines yes :wrap EXAMPLE
#+BEGIN_SRC ruby
  tab_a.full_join(tab_b, 'id_a == emp_id_b').to_aoa
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
| Id | Name  | Age | Address    | Salary |  Join Date | Id B | Dept        | Emp Id |
|----+-------+-----+------------+--------+------------+------+-------------+--------|
|  1 | Paul  |  32 | California |  20000 | 2001-07-13 |    1 | IT Billing  |      1 |
|  3 | Teddy |  23 | Norway     |  20000 | 2007-12-13 |      |             |        |
|  4 | Mark  |  25 | Rich-Mond  |  65000 | 2007-12-13 |      |             |        |
|  5 | David |  27 | Texas      |  85000 | 2007-12-13 |      |             |        |
|  2 | Allen |  25 | Texas      |        | 2005-07-13 |    2 | Engineering |      2 |
|  8 | Paul  |  24 | Houston    |  20000 | 2005-07-13 |      |             |        |
|  9 | James |  44 | Norway     |   5000 | 2005-07-13 |      |             |        |
| 10 | James |  45 | Texas      |   5000 |            |      |             |        |
|    |       |     |            |        |            |    3 | Finance     |      7 |
#+END_EXAMPLE

** Cross Join

#+HEADER: :colnames no :session example :hlines yes :wrap EXAMPLE
#+BEGIN_SRC ruby
  tab_a.cross_join(tab_b).to_aoa
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
| Id | Name  | Age | Address    | Salary |  Join Date | Id B | Dept        | Emp Id |
|----+-------+-----+------------+--------+------------+------+-------------+--------|
|  1 | Paul  |  32 | California |  20000 | 2001-07-13 |    1 | IT Billing  |      1 |
|  1 | Paul  |  32 | California |  20000 | 2001-07-13 |    2 | Engineering |      2 |
|  1 | Paul  |  32 | California |  20000 | 2001-07-13 |    3 | Finance     |      7 |
|  3 | Teddy |  23 | Norway     |  20000 | 2007-12-13 |    1 | IT Billing  |      1 |
|  3 | Teddy |  23 | Norway     |  20000 | 2007-12-13 |    2 | Engineering |      2 |
|  3 | Teddy |  23 | Norway     |  20000 | 2007-12-13 |    3 | Finance     |      7 |
|  4 | Mark  |  25 | Rich-Mond  |  65000 | 2007-12-13 |    1 | IT Billing  |      1 |
|  4 | Mark  |  25 | Rich-Mond  |  65000 | 2007-12-13 |    2 | Engineering |      2 |
|  4 | Mark  |  25 | Rich-Mond  |  65000 | 2007-12-13 |    3 | Finance     |      7 |
|  5 | David |  27 | Texas      |  85000 | 2007-12-13 |    1 | IT Billing  |      1 |
|  5 | David |  27 | Texas      |  85000 | 2007-12-13 |    2 | Engineering |      2 |
|  5 | David |  27 | Texas      |  85000 | 2007-12-13 |    3 | Finance     |      7 |
|  2 | Allen |  25 | Texas      |        | 2005-07-13 |    1 | IT Billing  |      1 |
|  2 | Allen |  25 | Texas      |        | 2005-07-13 |    2 | Engineering |      2 |
|  2 | Allen |  25 | Texas      |        | 2005-07-13 |    3 | Finance     |      7 |
|  8 | Paul  |  24 | Houston    |  20000 | 2005-07-13 |    1 | IT Billing  |      1 |
|  8 | Paul  |  24 | Houston    |  20000 | 2005-07-13 |    2 | Engineering |      2 |
|  8 | Paul  |  24 | Houston    |  20000 | 2005-07-13 |    3 | Finance     |      7 |
|  9 | James |  44 | Norway     |   5000 | 2005-07-13 |    1 | IT Billing  |      1 |
|  9 | James |  44 | Norway     |   5000 | 2005-07-13 |    2 | Engineering |      2 |
|  9 | James |  44 | Norway     |   5000 | 2005-07-13 |    3 | Finance     |      7 |
| 10 | James |  45 | Texas      |   5000 |            |    1 | IT Billing  |      1 |
| 10 | James |  45 | Texas      |   5000 |            |    2 | Engineering |      2 |
| 10 | James |  45 | Texas      |   5000 |            |    3 | Finance     |      7 |
#+END_EXAMPLE
